/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine could not complete the backup.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Open Time Machine Preferences…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Time Machine settings on this computer are controlled by Managed Preferences - contact your System Administrator.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "No error.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Unable to launch Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Unable to complete backup. An error occurred while creating the backup folder."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "The backup disk is not in Mac OS Extended (Journaled) format, which is required.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Open Time Machine preferences to select a different backup disk.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Unable to get status of backup disk."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "The backup disk does not have ownership enabled. You must have ownership enabled to use this disk for Time Machine backups.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Open Time Machine preferences to select a different backup disk.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "The backup disk is not in Mac OS Extended (Journaled) format, which is required.\n\n%@";
RESULTCODE_6_SHOWPREFS = "Open Time Machine preferences to select a different backup disk."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "This backup is too large for the backup disk. The backup requires %@ but only %@ are available.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine needs work space on the backup disk, in addition to the space required to store backups. Open Time Machine preferences to select a larger backup disk or make the backup smaller by excluding files."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Files can’t be copied onto the backup disk because it appears to be “read only.”\n\n%@";
RESULTCODE_8_SHOWPREFS = "You may need to repair or reformat the disk using Disk Utility. If the disk can’t be repaired, you must use a different disk for backups. Open Time Machine preferences to select a different backup disk."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "The backup disk does not have Access Control Lists enabled, which is required.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Open Time Machine preferences to select a different backup disk."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "An error occurred while preparing the backup."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "The backup was not performed because an error occurred while copying files to the backup disk.";
RESULTCODE_11_MESSAGE = "The problem may be temporary. Try again later to back up. If the problem persists, use Disk Utility to repair your backup disk.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "An error occurred while linking files on the backup disk."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Too many files changed while backing up."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "An error occurred while attempting to remove expired backups from the backup disk.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "All expired backups have been removed, but the backup disk is still full.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Open Time Machine preferences to select a larger backup disk.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "All expired backups have been removed, but the backup disk is still full.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Open Time Machine preferences to select a larger backup disk."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "No backup disk has been selected.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Open Time Machine preferences to select a backup disk.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "The backup disk could not be found.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Make sure the backup disk is connected or open Time Machine preferences to select a different backup disk."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "The backup disk is not available."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "The backup disk image “%@” could not be created (error %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "The backup disk image “%@” could not be accessed (error %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Backup canceled."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "A disk you are backing up is case-sensitive, but the backup disk is not.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Open Time Machine preferences to select a different backup disk or to choose not to back up the case-sensitive disk."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Two of the disks to be backed up have the same name. Please rename one of them."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "There are no disks available to be backed up. This can happen if all disks are in the “Do not back up” list.\n\n%@";
RESULTCODE_25_SHOWPREFS = "To edit the list, open Time Machine preferences and click Options.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine couldn’t complete the backup due to a network problem.";
RESULTCODE_26_MESSAGE = "Make sure your computer and the backup disk are on the same network, and that the backup disk is turned on. Then try again to back up.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "The backup disk may have been ejected or disconnected from your computer.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "The backup disk ran out of space unexpectedly. Time Machine will try to make more space available by removing expired backups during the next scheduled backup.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Open Time Machine preferences to select a larger backup disk or make the backup smaller by excluding files."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "The network backup disk could not be accessed because there was a problem with the network username or password.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Open Time Machine preferences to select the network backup disk and re-enter the correct username and password.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "There was an error while trying to reuse the backup “%@”.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "The backup disk image “%@” is already in use.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "The backup disk image “%@” could not be found.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "The system date and time is incorrect.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "The computer does not have a primary network interface.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine couldn’t find some of its settings.\n\n%@";
RESULTCODE_35_SHOWPREFS = "To reestablish Time Machine’s settings, open Time Machine Preferences and reselect the backup disk.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine couldn’t find some of its settings on the backup disk “%@”.\n\nMake sure the backup disk is connected, and that other connected disks don’t use the same name as the backup disk.\n\n%@";
RESULTCODE_36_SHOWPREFS = "To reestablish Time Machine’s settings, open Time Machine Preferences and reselect the backup disk.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "One of the disks being backed up may have been ejected or disconnected from your computer.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine can't use the disk image because it can't be written to.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine couldn’t verify your backups because the backup disk is not available.";
RESULTCODE_40_MESSAGE = "Make sure your computer and the backup disk are on the same network, and that the backup disk is turned on. Then try again to verify your backups.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine could not verify your backups.";
RESULTCODE_41_MESSAGE = "The backup disk appears to be “read only.”";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine couldn’t verify your backups because verification was interrupted.";
RESULTCODE_42_MESSAGE = "Interruptions are usually caused by network problems. Try again after the network problems are resolved.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine could not move aside the existing backup disk image “%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine could not delete the backup disk image “%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Error code: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "The backup disk is almost full.";
RESULTCODE_1000_MESSAGE = "When the backup disk is full, Time Machine will delete old backups to make room for new ones.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "If you prefer to keep all your old backups, open Time Machine preferences to select a new backup disk.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "The backup disk is full.";
RESULTCODE_1001_MESSAGE = "Time Machine deleted one or more old backups to make room for new backups. The oldest remaining backup is: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "To avoid deleting additional old backups, open Time Machine preferences to select a different backup disk."; 
RESULTCODE_1001_CHECKBOX = "Do not show this warning again.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine hasn’t backed up your computer in %@ days.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Make sure that your backup disk is available or open Time Machine preferences to select a new backup disk.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Would you like to reuse the backup “%@” with this computer?";
RESULTCODE_1003_MESSAGE = "The backup was created on a different computer. If you reuse this backup it can no longer be used by the original computer.";
REUSE_BACKUP_BUTTON = "Reuse Backup";
CREATE_NEW_BACKUP_BUTTON = "Create New Backup";
ASK_LATER_BUTTON = "Don’t Back Up Now";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "An update is available for “%@.”";
RESULTCODE_1004_MESSAGE = "This update improves Time Capsule reliability. To install the update, open AirPort Utility. You may need to provide the Time Capsule password for “%@.”";
REMIND_LATER_BUTTON = "Update Later";
AIRPORT_UTILITY_BUTTON = "Open AirPort Utility…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine completed a verification of your backups. To improve reliability, Time Machine must create a new backup for you.";
RESULTCODE_1006_MESSAGE = "Click Start New Backup to create a new backup. This will remove your existing backup history. This could take several hours.\n\nClick Back Up Later to be reminded tomorrow. Time Machine won’t perform backups during this time.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Start New Backup";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Back Up Later";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "The identity of the backup disk has changed since the previous backup.";
RESULTCODE_1008_MESSAGE = "The disk may have been replaced or erased, or someone may be trying to trick your computer into backing up to the wrong disk.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Use This Disk";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Don’t Back Up";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
